<script setup>
  import DeployVite from './components/TodoListEditDtoAbstract.vue'
  import AsyncController from './components/AsyncController.vue'
  import AuthController from './components/AuthController.vue'

  import { ref } from 'vue'

  let show1 = ref(false)
  let show2 = ref(false)
  let show3 = ref(false)

  import toTop from "@/UI/toTop.vue";
  toTop.scrollToTop =  true;
</script>

<template>
   <!-- <div v-html="content"></div> -->
  <div id="Vite_to_github" class="content">
    <div class="title">1.DeployVite
      <button @click="show1 = !show1">Toggle</button>
      <Transition>
        <div v-if="show1"><DeployVite /></div>
      </Transition>
    </div>
    <div class="title">2.AsyncController
      <button @click="show2 = !show2">Toggle</button>
      <Transition>
        <div v-if="show2"><AsyncController /></div>
      </Transition>
    </div>
    <div class="title">3.AsyncController
      <button @click="show3 = !show3">Toggle</button>
      <Transition>
        <div v-if="show3"><AuthController /></div>
      </Transition>
    </div>

    <div>
      <pre>
你好，我是子修，目前在緯創軟體擔任資深工程師，也是一名駐廠全端工程師。
我的個性溫和，待人友善，工作態度積極細心，也樂於協助同事解決問題。
在程式開發方面，我有獨立作業的能力，也有豐富的團隊合作經驗。
從前端到後端，我也參與過多項系統的開發專案。

我在製造業工作過一段時間，因此對製造業的資訊系統運作，有相當的了解。
像是生產管理、物料管理，以及設備連線的MES等。
這樣的經驗，讓我在進行 系統開發或導入的時候，能很快速的掌握業務流程，
同時也能站在使用者的角度，思考需求。

目前我主要負責的職務是全端發開，包括前端的Vue3、html、css、javascript
及後端的.Net Core 6 WebAPI開發，資料庫建立。
在過程中，我累積了許多寶貴的實戰經驗。
隨著專案逐漸穩定成熟，我希望能進一步挑戰雲端相關技術，特別是在持續整合/持續部署
(CI/CD)的技術。
選擇華邦是因為，在開發技術上，貴公司有明確的方向，在開發流程上，也欣賞團隊重視
開發品質與測試。
我也認同，公司重視工程師自主性的文化，這讓我能在這裡不斷學習，也能產出有價值的成果。
目我我以駐廠工程師的身份參與專案，期間無論在業務知識、技術能力累積，還有溝通合作方面，
都有許多收獲。
但我也希望未來的職務方面，能有更穩定的發展機會，能深入參與公司的核心系統建設。

為了持續提升自己的技能與知識，我平時會透過瀏覽各大論壇文章，來吸收新知。
例如：IT鐵人賽等技術活動。此外，我也會在Udemy線上學習平台 註冊相關課程，進一步學習技術。
透過這些學習方式，我能夠強化基礎知識，並讓自己有能力撰寫，高效，而且可維護及容易擴展的程式。

在實務工作鞏，除了技術能力對外，良好的溝通與團隊合作能力也非常重要。
我會持續加強與其他團隊成員的合作，特別是在與產品經理合作時，能夠深入理業務需求，
能將需求，轉他為程式實作。這不僅有助於提升個人的工作效率，也能促進整個團隊的運作與
產出高品質的程式。

有一次主管希望我們能在一個星期內，完成一個新功能的上線。包含UI、API、測試與部署。
但我評估後，認為這個時程明顯過於緊溱，可能會影響開發品質，也可能造成部署發險。
當下我沒有直接拒絕，而是先把需要完成的項目，拆解出每個項目需要的時間，並與主管討論。
第一，可能需要多幾天的時間，但保證測試完整度。
第二，需要簡化部份功能，能達到快速交付。
最後，希望能更完整的交付，主管選擇第一個方案。
我覺得主管會提出不合理的要求，或許是資訊不對稱，產生的誤解。
透過有效的溝通與具體的分析說明，是可以達到雙贏的效果。

在接下來的三年內，我希望自己能從一個技術開發者，逐步成長為有系統設計能力與技術影響力的
全端工程師。
我也希望參與大型系統架構設計，能累積更全面的實務經驗。
同時，我希望在團隊中能扮演橋梁的角色，能主動協調前後端、其他各個不同角色，共同解決問題。

我希望三年後，不僅能完成高品質的任務，同時也有能力引導他人、幫助團隊成長。

對我來說，最有成就感的時刻之一，是當一個專案完成，並成功交付給使用者後，
使用者在短短一個月內，就給予高度的正面回饋與肯定。
看到自己投入的心力，真正為使用者帶來幫助與價值，對我來說，是非常大的鼓舞，也讓我更有動力
持續精進自己。

我認為自己具備全端工程師所需要的技術廣度與合作能力，在前後端開發，能夠順利開發與整合。
在過去的專案中，我曾經獨立負責從前端頁面開發，到後端的API設計、資料庫建立與部署，
讓整個開發流程更順暢，也讓團隊更快完成目標。
我也有良好的溝通能力，能理解非技術背景同事的需求，將需求轉化為可寶現的技術解決方案。
我不只是一位開發者，也是一位會主動解決問題的團隊成員。
我認為自己仍有進步空間的部份，是在系統架構設計的深度，特別是大型，可擴展系統的設計模式
與效能優化。


協助NTC BOM系統架構的建立，主要功能，是協助O100單位, 
透過這套系統，有效率地與廠商來回溝通, 能夠快速的掌握料件的資訊。
我的角色是PG，協助BOM的全端開發, 從前端頁面的layout，後端WebAPI的開發、資料庫的建立 及
商業的邏輯分析。
功能包含當BD approved後，BOM即時產生。並當下發送信件給予廠商，
廠商收到信件，可以即時登入Partner portal 維護料件資訊。
當廠商填完資料，表單送出後，使用者也會馬上收到廠商回覆訊息。
同時，也建立5個表單通知功能。 即時發mail, 廠商pending, o100 pending。
bom approved。


在這個專案中，我負責協助 NTC BOM 系統架構的開發，
主要的目標，是幫助 O100 單位
能夠更有效率地與廠商
進行料件相關資訊的溝通與管理。
也就是，O100單位，能夠與廠商，有效率的雙向溝通。

我的角色是 全端工程師（PG），負責從 前端畫面的設計（Layout）、後端 Web API 的開發、
資料庫建置，到整體的 業務邏輯分析與實作。

這套系統的核心功能是：當 BD 核准後，系統會即時自動產出 BOM 表單，
並自動發送通知信件，給對應的廠商。廠商透過收到的信件連結，能夠即時登入 Partner Portal 
並填寫或維護料件資訊。
當廠商填寫完成並送出資料後，系統會立即將廠商的回覆通知 O100 單位的使用者，
能夠確保整體溝通流程，是即時且順暢。

此外，我也建立了4種表單通知功能，包括針對 
廠商填寫逾期通知（Pending）、
O100 單位未處理通知（Pending）、
BOM 通過核准通知（Approved） 等情境，
透過即時寄信提醒，強化流程的即時反饋與追蹤。

整體專案，讓我在技術與系統設計上，有非常完整的實戰經驗，
也學會了如何與業務單位密切合作，
針對流程痛點，設計出高效的解決方案。




      </pre>
    </div>

    <div>
      <pre>
        
就我在製造產業累積的16年經驗來說，
我參與了多項 製造數據平台建置與優化的專案，像是系統整合、自動化流程開發。
這些專案除了強化了我的技術實力，
也讓我能更深入了解 製造現場的實際需求，
進而提出具體可行的解決方案。

此外，我也有不少跨部門合作的經驗，像是與製程、設備，與IT團隊密切配合，推動改善專案的落地。
這些經驗讓我在技術之外，也具備一定的溝通與協調能力，
能夠協助企業在提升良率、降低成本等方面創造實際效益。

根據我對目前市場的了解，包括104的職缺薪資範圍，
資深全端工程師在科技與半導體產業大多介於九萬到十二萬之間。
這次應徵的職位在技術深度與職責範圍上都更廣，
因此我覺得十萬元的月薪，是一個合理而且具有競爭力的期待


我在製造產業，累積十多年的實務經驗，參與過 多項專案的開發與建置，
我也有許多跨部門合作的經驗。
根據我對目前市場的了解，包括104的職缺薪資範圍，
資深全端工程師在科技與半導體產業大多介於九萬到十二萬之間。
這次應徵的職位在技術深度與職責範圍上都更廣，
因此我覺得十萬元的月薪，是一個合理而且具有競爭力的期待
      </pre>
    </div>


  </div>

  <toTop></toTop>
</template>

<style scoped lang="scss">
.title{
  color:#5DC2A5
}
  .pdf {
    background-color: rgb(170, 63, 63);
    color: white; 
    font-size: .8em;
    padding: 0 5px;
    border-radius: 5px;
    margin-left: 3px;;
    text-align: center;
  }
  .box{

    // justify-content: center;
  }
  .content {
    // display:flex; 
    // height: 800vh;
    background-color: #282923;
    padding-bottom: 300px;
    color:#c1cccc; 
    font-size: 1em;
    div{
      margin: 20px;
    }
  }

  /* we will explain what these classes do next! */
  .v-enter-active,
  .v-leave-active {
    transition: opacity 0.5s ease;
  }

  .v-enter-from,
  .v-leave-to {
    opacity: 0;
  }
</style>